<unk>
<pad>
<s>
</s>
the
to
and
in
a
of
was
is
for
he
on
match
with
that
his
india
this
were
they
it
has
have
not
as
be
will
at
are
by
had
from
people
world
you
indian
won
also
their
after
i
team
there
said
her
however
but
an
very
cup
she
him
now
when
all
been
who
ipl
players
would
played
about
first
2022
cricket
then
teams
against
matches
2
held
win
out
over
runs
dhoni
pakistan
well
2023
did
if
many
me
because
captain
england
kohli
which
bcci
between
time
like
two
medals
we
medal
took
tournament
one
play
so
test
am
let
stadium
my
olympics
singh
years
everyone
final
games
lost
no
only
t20
why
day
even
fans
media
player
rs
these
police
since
wickets
being
during
virat
may
other
sharma
started
announced
australia
delhi
know
october
up
video
viral
5
can
india's
made
scored
see
sri
tell
went
what
while
cricketer
finals
playing
proud
social
such
wanted
gold
international
never
new
odi
pm
support
3
both
deaf
july
mumbai
news
series
2021
amazing
down
etc
huge
sports
year
4
6
icc
lanka
or
victory
football
government
its
more
same
them
want
wrestlers
-
8
back
bowler
cricketers
going
rohit
saying
yuvraj
any
before
championship
crore
go
lot
name
silver
total
winning
women
always
could
covid-19
decided
hotel
how
just
olympic
another
around
athletes
called
came
csk
decision
do
due
each
lakh
last
must
old
second
10
bat
batting
bowl
comments
couple
field
group
indians
led
modi
next
posted
qatar
some
super
where
argentina
ball
excited
gambhir
instagram
men
november
overs
score
times
too
1
15th
afghanistan
asked
balls
bronze
family
former
game
got
happy
june
left
messi
minutes
most
neeraj
part
start
tokyo
told
watch
wicket
women's
1st
2020
away
countries
court
earlier
face
famous
paid
place
raina
rajasthan
shocked
staff
take
zealand
7
along
became
become
bowled
company
does
every
good
here
incident
known
kumar
loss
positive
praggnanandhaa
rights
ronaldo
africa
amrapali
august
chennai
despite
fifa
four
get
hard
home
hope
including
jersey
kings
love
married
number
off
pant
patel
person
post
rahul
reached
secured
shocking
still
sushil
taken
tested
than
toss
tweeted
various
wife
wonderful
afghan
ahmedabad
argument
asia
commonwealth
country
covid
currently
different
girl
goals
help
images
into
keep
kept
minister
money
ms
own
pictures
put
reason
recently
report
several
shared
similar
south
taylor
though
three
till
twitter
used
way
wfi
without
wow
wrestler
12
23rd
9
able
according
age
april
auction
azam
batsman
bowlers
cases
catch
chahar
come
days
encourage
extremely
fast
father
few
fine
flight
following
high
hyderabad
image
innings
instead
lose
luck
make
man
march
met
multiple
overjoyed
phogat
picture
poland
room
sapna
saw
season
seen
sent
september
set
similarly
state
strong
team's
tests
think
trophy
umpire
us
vamika
your
16
28th
3rd
4th
anushka
association
australian
baby
badminton
best
board
book
brand
car
celebrate
challengers
coach
committee
daughter
end
fan
finally
followers
found
full
given
hit
immediately
included
india'
interesting
involved
javelin
later
league
life
long
losing
marriage
matter
meet
national
pay
penalty
per
punjab
qualified
received
royal
royals
sad
shah
should
star
stay
taking
tennis
tickets
top
woman
yesterday
young
14
14th
15
18
20
2019
5th
6th
across
again
among
arrested
arshdeep
asian
bangalore
batsmen
bowling
boy
captaincy
category
championships
changed
child
close
decide
defeat
dubai
equal
february
fee
focus
food
gave
give
happened
hardik
january
japan
legends
lionel
lucknow
million
mohammed
moment
mother
narendra
needed
pandya
participated
remember
rooney
sai
share
situation
six
skipper
son
special
story
sure
table
talking
third
those
vinesh
vs
wait
wear
whenever
'i
'‚¹
10th
13th
2016
2nd
50
7th
allowed
already
amount
babar
bad
bangladesh
banned
began
behaviour
believe
british
builder
bumrah
call
capitals
carlsen
chief
compete
complaint
congratulations
crores
dahiya
difficult
ended
entire
event
filed
fined
five
footballer
friends
girls
glued
groups
gujarat
having
hence
highest
hospital
hours
isn't
issued
jadeja
khan
kkr
kumble
lead
meanwhile
members
men's
messages
moved
named
negative
odis
official
once
others
our
owns
package
participating
performance
prior
private
pune
qualify
quarantined
rcb
remaining
rest
retirement
right
rule
rules
rumours
sachin
say
scoring
screens
seven
shaw
shobit
show
skills
soon
stopped
strange
talented
tendulkar
thought
through
throw
ticket
title
towards
tried
trolled
tv
under-19
upset
warne
watching
wearing
wedding
wrestling
wrong
yet
16th
19
2011
2012
2017
23
25th
28
29th
8th
achievements
actually
advertisements
ali
announcement
athletics
b
bag
bcci's
bought
broadcasting
brought
buy
c
camera
canada
case
centuries
chartered
chopra
chose
congratulatory
contingent
continues
crowd
cummins
cwg
danushka
date
dating
december
deepak
defeated
dhanashree
dhoni's
didn't
district
don't
dravid
edition
elated
emergency
ensure
expensive
failed
fight
finished
fir
follow
followed
ganguly
getting
gift
gill
handed
head
hearing
heart
history
hockey
infection
injury
interaction
kl
knight
kolkata
looked
making
means
month
months
names
online
opening
outside
owners
pakistan's
pakistani
pandemic
participate
photo
pitch
please
posts
present
president
press
prime
protest
racial
rain
rates
ravi
refused
reliance
reports
respect
revealed
riders
rooms
schedule
sex
shami
shot
side
sindhu
siraj
sixes
small
sold
speaking
spectators
spinner
step
stop
strict
stumps
suffered
superstitions
suresh
t20i
takes
taliban
thanked
tie
today
training
travelled
uae
unable
under
united
use
verma
viewers
water
weightlifter
whether
wore
work
wrote
youth
11th
12th
17
18th
1992
2000
2008
26
27
29
30
60000
abuses
account
achieved
added
admitted
ahead
allow
ambassador
anil
anyone
anything
argentina's
armbands
asif
athlete
attack
axar
ban
beaten
beer
belgium
beliefs
believed
bidding
big
black
booked
booking
brawl
brazil
break
broke
broken
brother
can't
care
celebrities
ceremony
chanu
charge
chess
chest
children
cities
city
colombo
comes
community
competing
complete
completed
condoms
conference
continued
controversies
controversy
coronavirus
count
cpr
cristiano
deaflympics
denmark
digital
done
drink
drinking
dropped
drunk
duck
everyday
example
feel
female
find
formats
forward
fourth
franchise
future
gautam
gesture
ground
guwahati
half
hand
handle
hands
health
heated
helped
holding
hoping
inappropriate
includes
indies
indiscipline
infections
instance
italy
jasprit
jay
jokingly
krunal
landed
leading
legendary
lgbtqia
live
look
looking
loved
major
managed
maria
medical
mental
messi's
mi
middle
might
milkha
miny
mirabai
mlc
mobile
model
mp
natasa
needs
night
numbers
oc
opted
order
pain
parents
passed
pathirana
poor
position
possible
posting
practice
practise
prevent
privacy
protesting
public
rana
ranji
rape
rashid
really
region
religion
remain
remained
response
retired
rising
rosario
round
run
rushed
sanayev
scheduled
secure
seeing
selected
semi-final
short
showed
single
sky
smashed
smith
sourav
sponsors
statement
stood
stressed
stunned
sunrisers
superstition
supreme
surprising
suspended
symonds
talk
target
thakur
thank
things
thousands
threats
tie-breaker
tournaments
turn
umpire's
umpires
updates
upon
upto
village
walking
weightlifting
west
whoa
wicketkeeper
within
worth
yadav
1-1
11
120
1983
1998
1999
2-3
2015
2018
20th
22
22nd
25
250
27th
30th
35
36
48
50000
61
66
90
935
9th
absolutely
accompanied
achievement
affection
agency
aggressive
aim
ajaz
albanese
alcohol
alleged
american
anthem
apart
appeared
applause
appointed
ashes
ask
asking
authority
awards
aware
bagged
based
batter
becoming
beijing
below
better
bid
biggest
biles
birth
blamed
bottle
boys
bring
broad
calm
cancelled
cancer
carry
cash
caught
century
ceo
chahal
champion
champions
changes
chaos
check
china
christian
claim
clash
closed
coca-cola
commercial
common
companies
completely
concerns
congratulated
continue
council
covered
crazy
created
crowds
crush
csk's
cups
cure
de
death
delay
demanding
devastated
died
dinner
disappointed
disgusting
doctors
doing
dreams
drinks
drugs
early
ecstatic
efforts
empire
encouraged
encouraging
enraged
eriksen
ever
everything
excitedly
exciting
experience
explain
faced
far
federation
feelings
felt
finger
fit
flag
flooded
form
fox
free
gathered
germany
giving
gloves
god
goes
golden
great
guests
haryana
hate
himself
hosted
hotels
hou
housing
hurt
husband
idesign
important
incidents
individual
infected
injured
insta
internationals
introduced
ioa
ish
ishan
issues
janeiro
job
junior
kartikeya
kaur
knows
kuwait
lankan
less
level
levied
lifted
liked
list
living
logos
london
low
mahendra
malik
manage
manchester
mandhana
marcus
massive
mayor
meeting
mers
mind
mirza
miss
mohammad
morning
morocco
movement
moves
much
netizens
nine
oath
opponents
organisers
origin
orion
owned
pad
participants
parties
passport
performed
period
permitted
personalities
phones
physically
pizza
places
platforms
plays
polish
popular
postponed
preparing
price
pride
prize
problem
proceeded
projects
punia
purchased
pv
queen
question
quickly
quiet
quit
r
railways
rainbow
rains
ramnagesh
recent
referee
refunded
released
remove
removed
reserve
respective
restaurant
retire
return
returning
rhiti
rio
rise
risk
ross
safe
safely
safety
sagar
sahara
sania
secretary
security
semi
separate
sexual
shane
shock
shots
shubman
singlet
site
slow
smashing
snake
something
sonam
sor
spreading
stadiums
stage
staying
stepped
stepping
stories
stuart
suffering
sunil
supermarket
supporting
supposed
surely
surprisingly
survived
talks
tally
teammates
tenders
thing
thus
tied
titans
together
touch
train
travel
trouble
true
tweet
upcoming
usa
using
vamika's
venues
viacom18
victories
videos
violent
waiting
walked
wasn't
weeks
whose
wimbledon
winners
wins
wishes
world's
yes
york
yuzvendra
zimbabwe
'the
'‚¹2
'“
103
1206
150
17th
1990
2-1
2003
2007
2013
2024
21
217
269
3-1
3-match
31
39
41
448
46
49
51
52
55
630
65
67
700
73000
92
abu
abused
abuzz
accomplisments
accounts
accused
ace
adani
agree
agreed
ahmedabad-based
air
airport
ajay
alive
allegedly
ambulance
america
amid
amidst
analyst
andrew
anger
angry
announce
anywhere
applies
approached
arbitrator
area
assault
attacked
attended
auctioner
audience
audit
australia'
available
avoid
azam's
babita
badly
bail
balwani
banglore
batra
beat
behind
belongs
ben
bengaluru
bestowed
bhogle
bhushan
bike
birmingham
bjp
blessings
blood
bond
bottles
brij
brilliant
brings
broadcast
brussels
building
bwf
calling
calls
calmed
camel
candy
cap
capital
capital'
captains
caption
captioned
career
carrying
casteist
celebrated
celebrating
celebration
challenges
chandigarh
change
charges
chase
chasing
chat
chhetri
choice
cited
citizens
civilian
clarity
clear
club
collection
comfortable
commentator
communicate
competition
complained
confidential
confused
congress
consisted
contain
copa
couldn't
county
credit
crime
criticized
culprits
cultural
current
d
daily
daley
dated
daughters
dead
debut
deducted
deepika
deeply
delayed
delivery
detained
devdutt
developers
dhabi
dhawan
diagnosed
dignitaries
dinesh
direction
disappointing
disclosed
discussion
dismissed
displayed
diving
doesn't
dollar
donate
donated
donating
doping
doubles
doubt
draw
dream
drive-in
drs
earn
earns
earth
east
effort
eighth
ending
endorse
endorsing
ends
english
enjoying
equally
estate
euro
events
eventually
exact
expected
experienced
expressed
extra
fact
false
fame
families
fareed
feeling
fell
fever
fierce
file
finland
fired
fireworks
fix
flu
forget
fortis
france
france's
franchises
friend
fun
funny
furious
further
gaikwad
gaming
garnered
generally
girlfriend
goal
goalkeeper
gold'
gone
grandmaster
gujarat's
halted
hansi
harbhajan
hardworking
harmanpreet
harrassment
haven't
he'
heading
hearts
heavy
heineken
hold
holds
homes
honour
hooked
host
hosts
house
houses
human
hungary
ice
idea
imagine
imperative
increase
india-pakistan
indigo
individuals
infidelity
informed
inning
innocent
inputs
inquired
inspector
insulted
intended
intense
intentions
interrupted
intervened
invested
investigation
ireland
it's
james
javelineer
jaya
joined
joins
joke
judge
jump
kane
kanyakumari
keeping
keeps
kg
khalistan
kind
king
kishan
kiwis
kochi
kohli's
krishnan
kylian
language
lanka's
largest
late
launch
law
leadership
leaked
least
leaves
lee
leg
leg-spin
let's
light
limited
lips
logo
long-handle
longer
looks
losses
lucknow's
lucky
maintain
male
management
manager
manika
margin
maå‚ysa
measures
melbourne
men'
merseyside
ministry
minor
missed
missing
mocked
move
moving
mumal
mumal's
mural
murdered
music
muslim
nabi
nadeem
nadu
namibia
naresh
nation
nations
navratri
need
neutrality
nice
north
note
nothing
notice
noticed
occured
often
oh
omicron
ongoing
onto
opened
openers
opportunity
option
ordered
organised
outstanding
over-rate
overseas
owner
oxygen
padikkal
panel
pans
particular
partners
pat
paying
permission
personal
personnel
phone
photograph
pick
placed
planning
plans
plus
pogba
points
pooran
postpone
pouring
practised
preponed
previously
probe
problems
professional
proof
proposal
protective
proved
provide
pubg
purposely
questioned
raining
raise
raised
rate
rather
reach
reaching
real
realised
receiving
recieved
recognised
reduced
registration
religious
rent
replaced
replied
reported
request
requested
required
reschedule
rescheduled
reshared
resignation
respectively
resumed
returned
returns
reveal
reward
richest
road
rockets
ronaldo'
rpsg
runner
running
saddened
saha
sakshi
sameeha
samir
sandwiches
sanjana
sapphire
saving
school
scoreboard
seasons
seconds
securing
seeking
sehwag
selection
selectors
selfies
semi-finals
send
separation
serious
services
session
shameful
shami's
shardul
shares
sharing
sharma's
shekhar
sheuli
shikhar
shiv
shoaib
shockingly
shoot
shootout
shortlisted
shorts
shown
sides
sign
singh'
sixth
slapped
slc
slurs
sorry
spending
spike
spoke
sponsor
spread
squad
stamina
standing
stankovic
steve
sticky
straight
strongest
strongly
stump
submit
subsidiary
succeed
sudden
suga
suggested
superintendent
surgery
surname
surprised
sweater
swimwear
sydney
symptoms
system
t-shirts
tagged
talent
talked
tamil
tears
thankful
that's
themselves
thrilled
thrilling
thrower
today's
tops
totally
tough
towel
traveled
travelling
treatment
trent
tricolour
triggered
troll
trolling
trolls
truly
trying
tuskers
uk
unbeaten
uncle
undergone
unfortunately
unhygienic
unvieled
users
uttarakhand
uttarakhand's
valued
vandana
variant
vehicles
vengsarkar
violation
violence
virus
visit
viswanathan
vows
wac
wankhede
wants
war
wealth
website
weight
welcome
whereas
whole
whopping
widely
winner
wish
wished
witnessed
wives
woman's
women'
won't
wondering
words
worked
working
worn
wrapped
wriddhiman
xi
yashpal
zabka
'flying
'keech'
'madewithlovebytomdaley'
'people
'raina
'why
'œi
'œmirabai
'œpeople
'œsports
'œusman
'œvirat
'˜finally
'˜messaged'
'˜the
'‚¹35
--
0-1
0-100
01
1-0
10-15
10-wickets
100-ball
100-metre
1000
101
1055
109
111
112-run
115
121
122
123
1230pm
126
128
13
13000
133
1355
137
139
14-year-old
140
1402
141
15-24
1520
1525
160
1686
170
172
175
176
178
179
183
184
1843
1882
189
190
1900s
1923
1924
193
1930
194
195
1951
1956
1958
1959
1964
1966
1968
1976
1978
198
1980
1980-90s
1986
1987
1988
19th
2-0
2-2
2-4
20-over
20000
2005
2006
2009
201
2010
2021's
2021'“22
204
2055
211
219000
21st
226
228-runs
23-year-old
230
236
24
240
249
24th
251
263
26th
27000
275
2759
276
293
3-2
3-3
300
3000
300kg
310
313kg
3175
32
32-run
321
330
337
34
34th
35-year-old
350
356
3562
3570
360
37
37-year-old
372
3am
4's
4-2
4-weeks
410
417
43
45
450
48390
49kg
4x400m
5-4
5-match
500
54
55170
5522
56-member
5610
5700
58
594
5950
599
6's
6-3
6-ball
62
652
655-member
65kg
68
6am
7-5
70
72
73
730
73kg
75
78
80
8000
81
87
883
8933
9-month
90-minute
91
911
915
95
96
98
abdomen
abhinav
ability
abroad
absentminded
absolute
abysmal
acc
accept
accepted
accepting
accident
accomadation
accompanies
accpet
accross
achieve
achinta
acknowledged
act
active
actor
actress
actual
adamant
additional
adminstration
ads
advances
advert
advertisement
advertisers
advised
aerated
afc
affair
affairs
affected
african
agaisnt
agastya
aged
agencies
agitated
ago
agreements
agressive
agua
ahemdabad
ahmed
aiming
aims
airfare
airline
airthings
aiscd
aisle
ajnd
alex
aliana
alibathini
alike
all-rounder
allah
allegation
allegations
allowing
almost
altercation
alternately
although
amassing
amateur
amazed
ambanis
anand
andrejczyk
anees
angel
angom
ani
anita
anju
annoucement
annual
anrich
ans
answering
answers
anthony
anti-doping
anti-india
anticipatory
antwerp
anurag
anushka'
anybody's
anymore
anytime
apex
appalud
appealed
appearances
applauded
applicable
applied
apply
appointing
appreciated
appreciating
appreciation
apprehended
approved
arbitrate
arbitration
arch
arch-rivals
archer
architecture
areas
argentina'
argued
arguing
arguments
arm
arms
aromatic
arrangements
arrived
arshad
arshdeep's
arsheep
arvind
ashish
ashwin
ashwini
aside
assam
assaulting
assistant
assists
associate
associations
asssualyt
assume
assured
asthma
astonishing
atal
athapaththu
athiya
athletic
atkinson
attacks
attain
attempted
attend
attention
attitude
aurobindo
australia's
awaited
award
awarded
awared
awareness
awful
ayurvedic
azharuddin
babies
babycare
bacause
backdrop
background
backlash
backless
backside
bags
bails
bajrang
balance
bana
bangalesh'
bangalore'
bankrupt
bankruptcy
bar
bare
barmer
barsapara
barwin
base
baseball
baseless
basis
bathroom
batsman-wicket
batsmen's
batters
bawa
beaches
beating
beautiful
becomes
bed
beds
beginning
behalf
behaved
beleive
belief
believes
belligerant
belongings
beloved
beneficial
benefit
berlin
betweem
bhaichung
bhaker
bhambri
bhardwaj
bhutia
bidder
bigg
bihari
bikes
bilateral
bindra
birbal
biren
birthdate
bishnoi
bitcoin
bite
bizarre
blame
blast
bleary-eyed
blessed
blew
blockbuster
blocked
blonde
blow
blurred
blushing
boarding
boards
bobby
bold
bomb
bookingcom
bookmyshow
boost
boot
booth
border
boris
boss
bounces
boundary
bounds
bout
bouts
box
boxer
boyfriend
breathed
breathlessness
brett
bridesmaids
bringing
britishers
broadcaster
budapest
budget-friendly
builder'
buildings
bukayo
bullet
bursted
bursting
bus
business
buttler
buyers
buying
buys
buzzing
cake-walk
california
cama
cameras
cancel
canceled
cancellation
cannons
cannot
canoe
capitals'
caps
captained
captainship
capturing
cardiff
careful
cares
carried
casillas
cause
causing
cautious
cbd
celebratory
cements
cent
central
centre
centruries
chahal's
chain
chains
chair
challenge
chamari
champ
champagne
chance
channu
chanting
chants
chanu'
chapagne
charged
charu
chats
cheap
cheaper
cheated
checking
cheer
cheering
cheers
chefs
chemical-free
chennai's
cherish
chhatrasal
chidambaram
childcare
chills
choices
chris
circled
civilians
claimed
claims
clarification
clashed
class
clearly
clicked
client
clinched
clip
cloak
clothes
clothing
clubs
cm
co-founded
co-parenting
coaches
coaching
coca-cola's
coincidence
coincidentally
coleen
collapse
collapsed
collect
collected
colony
colourful
combining
comfortably
coming
commenced
commendable
commended
comment
commentary
commentators
commented
commission
communication
community'
competed
competitions
competitive
complain
completing
completly
compressions
compromise
conceded
concern
condemned
condition
condom
conduct
conferred
confidentiality
confirmed
confirming
confirms
confrontation
confronted
congratualted
congratualtory
congratulate
congratulating
connected
connection
consent
considerable
considering
considers
constantly
construction
consult
consulted
consumed
contact
contacted
contacts
contents
contested
continental
continuous
contract
contributed
contributions
control
convenience
convenient
convey
cool
cooperative
copenhagen
cops
copy
corporate
corporation
cosmetic
costed
costs
coughed
coughing
counterpart
counts
couple's
couples
court's
cover
covering
crackers
cramps
crashed
crashing
craving
craze
crazily
cream
crease
creations
credited
cricket'
cricketer's
cricketers'
cricketing
criminally
crisis
cristano
critical
criticism
crown
cryptic
cryptocurrency
culture
curries
custody
customers
cute
cuttack
cvc
daei
dalit
damage
damaged
dance
danced
dancer
dancing
danger
danish
dates
daughter'
daughter's
david
dc
dead-rubber
deaf'
deal
dearly
deaths
debate
decisions
declared
declined
dedicated
dedication
deducting
defence
defended
definitely
deflect
delaying
deleted
delhi'
delhi's
deliveries
delta
deluxe
demand
demands
demise
democracy
denied
departure
depending
deployed
derby
detail
details
determine
determined
dettection
dev
developed
developer
development
devices
devotion
dhami
dhanashree's
dharamshala
dhull
diabetes
diamond
diana
diego
diet
differences
difficlut
digest
dilip
directions
directly
director
disapproval
disassociate
discouraged
discuss
discussing
disease
dishesif
disperse
displaced
display
dispute
disqualified
disrespect
disrespectful
dissappointed
dissolution
distraught
distressed
diver
divert
diverted
documents
doherty
dollars
dominated
dominos
donation
door
doors
double
downloaded
downloading
dozen
dragging
drastically
dressing-room
driving
drop
drowned
drug
duo
duped
durham
dushyant
dustin
dutt
duty
dying
eager
easily
easy
eat
eaten
eating
edited
edmeades
edulji
effects
eight
elected
electronics
elizabeth
elizabeth'
eloped
else
embarassing
embroiled
emerge
emerged
emi
emmerged
emoji
emotion
emotions
employee
empty
encounter
end-of-series
enemies
engagement
engineer
england'
england's
engraved
enhacing
enhancing
enjoyed
ensuring
enter
entered
entering
entrance
equestrian
era
eriksen'
erskine
escorted
establish
eunuch
europe
european
eva
evade
evaluate
everone
everybody
everywhere
exacting
excelled
excellence
excellent
except
exception
exceptional
exceptionally
exchange
excuses
executives
exit
exoected
expectation
expert
experts
explained
exposure
express
extraordinary
extravagant
fa
faith
fake
fall
fallen
falling
falls
faltered
fanatic
fancy
fans'
fantastic
farewell
farhart
fastest
father's
fault
favorite
favourite
fear
fears
feat
featured
featuring
fedup
fellow
fence
ferrari
festival
festivities
fide
fielders
fielding
fiery
fifa's
fifth
fifties
fighter
fighting
figures
files
film
film-maker
filmstars
financial
fines
fingers
firebird
firecrackers
firing
firm
fitness
five-match
five-over-per-side
fixed
flags
flats
flee
flew
floor
flops
fly
flying
folding
follows
folowers
footage
footballers
footwear
force
forced
forearm
foreign
formal
format
forms
fort
fortunate
fortunately
fouaad
foundation
founder
fours
fourth-highest
frame
fraternity
freedom
freestyle
french
frequent
front
frustrated
fueled
fund
funds
fury
futuristic
gandhi
ganesan
gang
gas
gavaskar
gay
gayle
gc
gemma
george
georgina
german
giants
gifted
girl's
gives
glass
glove
gmr
goa
god's
goenka
governing
gown
grabbed
gracefully
grade
graded
gradually
grandfather
grandson
grate
grateful
gratitude
greater
greatly
greedy
grew
grooved
ground-staff
groundsmen
group's
grow
growing
grown
gto
guard
guidelines
gunathilaka's
guru'
guts
gymnastic
gymnastics
h2
hales'
half-centuries
half-century
halfway
halt
halves
hamstring
handkerchief
handsome
handwritten
hanged
hangzhou
happen
harass
harbhajan'
hard'
hardly
hardwork
haridwar
harmful
harmony
harsha
harshal
hasn't
hats
havoc
hazel
headache
headers
healthy
heard
heartbeats
heartbroken
hearted
hebestreit
heels
heights
heights'
henceforth
henious
higher
hiked
hind
historic
hitting
hiv
holders
homeland
hometown
homosexuality
honest
hong
honoured
honouring
hoped
hopeful
hopes
hosting
hoteliers
hour
household
hugged
hugh
humanitarian
humble
hummer
hundred'
hundreds
hungary's
hurled
hurling
hyderabad's
hygienic
hypocrite
i'll
i'm
icu
idca
ideas
idol
idols
ie
ignored
igor
ii
iker
illegal
illnesses
ilt20
imitate
imjadeja
immunity
impartial
imphal
implement
implemented
importance
impose
impossible
impressive
improper
impulsive
imran
imtiaz
inaccurate
inapt
inaugural
incase
incidence
inclusion
income
incorrect
increased
increasing
incredible
incurred
indefinitely
independence
india-
india-american
india-new
indian's
indirectly
indulging
industries
inflated
influencer
information
infuriatred
initial
initially
initiate
injuries
inquiry
insane
inscribed
insisted
inspiration
insult
integral
intensity
intensive
intention
interacting
intercourse
interest
interested
intervening
interview
interviewed
interviews
invaded
invading
investigate
invited
involvement
ioc
ipad
iphone
iphones
ipls'
iran's
ironically
irritated
isolation
issue
ist
it'
italian
itc
items
itself
izhaan
jadon
jai
jail
jailed
jantar
japan's
japanese
javagal
javelins
javkin
jayne
jealous
jealousy
jensen
jeremy
jerseys
jets
jharkhand
joburg
jofra
johnson
joked
joking
jos
journalist
jovial
jubilant
jubiliant
jubliant
judiciary
judo
jumped
jumping
justice
kaif
kakching
kalsan
kanasar
kandy
kanteerava
kardashian
karnam
karthik
kashmir
kasi
katariya
kazakhstan's
keen
keeper
kejriwal
key
khan's
khan-led
khushdil
khwaja
kickstarted
kidambi
kids
kieron
killed
killing
kim
kingdom
kings'
kishan's
kissed
kisses
kit
kiwi
kmhour
knee
knit
knitting
knock
knocked
knocking
knockout
knocks
knot
knowing
kohli'
kom
kong
konkan
kozhikode
krishna
kuala
kvist
la
labs
laced
lack
lakhs
lalrinnunga
lance
land
lankans
large
lashed
lastest
lasting
lasts
latest
lauded
laugh
laughs
lawn
laws
layers
laying
leader
leaders
leagues
leander
learn
learned
learning
leave
leaving
leg-spinner
legacy
lend
lesser
lessons
lets
letter
levels
liam
life-saving
lifelong
lights
likes
likewise
limit
lineup
lingerie
listen
little
lives
livingstone
load
lobby
location
lockdown
lodge
lodged
lok
loose
loses
lots
lovely
loves
lower
loyal
ltd
lumpur
lung
luxurious
lying
lyons
ma
maate
machester
madhya
magical
magnus
maharashtra
mahi
mahi7781
maiden
main
malayasia
malaysia
malleswari
manipur
manipur'
manner
mantar
maracana
maradona
marketing
marks
marry
marsh
martinez
martyred
maruti
mary
masked
mastercard
masters
mateo
mates
matters
matthew
maybe
mbappe
mbappã
mca
me'
mean
meaning
meantime
medalist
medications
medicine
meetings
mehar
member
membership
meme
memes
mena
mens
mentally
mentioned
mentor
mere
messaged
messi'
microphone
middle-class
milicious
mills
minimum
ministers
minors
minsters
minute
misbehaving
misconduct
miscreants
mismanagement
mistake
misunderstand
mitchell
mixed
mockingly
mode
models
modi's
mohali
mohali's
moments
monsoon
moreover
moroccan
moroccans
morocco's
mostly
motion
motivate
motivated
motorcycles
mouth
mouths
mujeeb
multi-sports
mumbai's
mundka
murder
murderous
murders
muscle
mutual
n
nagal
nasty
natasa's
natasha
native
natural
nature
navi
near
needto
neeraj's
neither
neophitou
nepal
nervous
netherland
netherland's
netherlands
nets
neutral
newer
newspapers
nicest
nicholas
nigeria
nike
nirmal
nishu
no-balls
noida
non-bailable
non-exclusive
nonchalantly
nongpok
normal
normally
norms
nortje
nose
notable
notably
nov
numberless
numerous
nuptials
nurislam
observations
occasions
occurred
od
offensive
offer
offered
office
officers
officially
officials
offspring
olympians
oman
once-in-a-generation
onwards
open
openly
opens
opportunities
oppose
opposed
oppression
oppressive
optimism
options
orcas
organising
organizational
organizers
original
oscar-winning
ott
outbreak
outfit
outing
outrage
outraged
over-burdened
overcome
oversight
overthrew
oylmpics
pablo
pack
packed
padma
pads
padukone
paes
pair
pakistan'
pakistanis
paltry
pandemonium
pani
panned
paper
paps
par
paris
parity
parting
partner
parts
passionate
paste
pathetic
patiently
patrick
patron
patted
peace
penalised
performances
performing
permanently
permit
perserve
personality
persons
persue
perth
pharma
pharmaceuticals
philippe
physio
picking
pinned
planned
platform
player'
players'
playoffs
plea
pleas
plethora
plunged
pocket
point
pointing
poisoning
pole
policeman
political
politicians
pollard
ponappa
pontiac
pools
pop
popularity
popularly
porche
portion
portugal
portugal's
portuguese
pose
posed
positivity
potential
potentially
pouch
powerful
practicing
pradesh
pradesh's
praise
praised
pranks
prasad
prasidh
prayers
predicted
predictions
preferred
pregnant
preliminary
premadasa
premier
premiere
premises
prepared'
presenter
pressure
pretended
prevented
previous
prices
prince
prison
prithvi
proceedings
proceeds
process
produced
products
profit
programmes
programs
progressed
prominent
promised
promote
promotion
proper
properties
propose
prosecuted
proselytizing
protein
protocols
prove
provides
provisions
pt
pti
publicly
publishes
pulled
punishment
purchase
puri
push
pushkar
qartar
qualifed
qualifies
quarantine
queues
quite
quiter
quote
quoted
rage
raiding
rainbow-themed
raj
rajasthan's
rajat
rajeev
rajender
ramana
ramanathan
ramesh
rameshbabu
ranchi
ranking
ranks
ranveer
rapid
rapidly
rashford
rashford's
rautela's
ravichandran
ravindra
rcb's
reaches
reaction
read
reading
reality
reasons
receive
recognise
recognized
record
record-holder
recording
records
recovered
recovery
recreated
refusal
refuse
regarding
registering
regret
regular
regularly
regulation
rejected
relationship
relative
relatives
relaxed
relay
release
relief
relieved
religions
removes
renamed
renew
renewed
renowned
rented
rents
repeatedly
replace
replacement
reply
reporters
reposted
representative
represented
representing
requesting
residence
residents
resolved
resorted
resorts
respected
respecting
respiratory
respond
responded
responsible
restart
restarted
restaurant'
restricted
restrictions
resturant
result
resume
retained
retainership
retesting
revealing
reviewing
revive
revlon
rew
rewards
rewrites
rich
right-arm
rings
riots
rishab
rishabh
rival
rizwan
roads
rode
rodrã­guez
role
rolled
roma
ronald
ronaldo's
rooney'
roots
roshan
roshnabad
rotterdam
rounds
routine
rsws
rt-pcr
rto
rtpcr
rubbish
rudely
rukh
rumor
rumors
rumour
run-up
runny
russia
s
sa20
sabha
sabrina
sack
sacked
sacking
saddens
sadly
sadness
saff
saharan
sahicoin
saikhom
saka's
salamath
salaries
sale
sameeha's
samosas
sample
sancho
sanjay
sanjiv
saphire
sat
satish
save
sc
scam
scammed
scandals
scantily-clad
scare
scoreline
scorer
screen
screenshots
scrored
scrumptious
scst
sealed
search
searching
season'
season's
seattle
secret
sections
seem
seemed
seems
sehwag'
select
seller
sells
sending
seniority
sense
sensor
sentiments
separatist
servants
settle
severe
severely
sexchat
sexually
shakes
shaking
sham
shamed
sharan
sheets
shetty
shielded
shifted
shirts
shoe
shoes
shoot-out
short-run
shortage
shouts
showing
shri
shukla
shut
sick
sided
sidharth
sigh
signalled
sikh
sikh'
silent
silly
similarities
simultaneously
sing
singh's
singles
sip
sister
sitting
sixteen
skeptical
skill
skipped
skyscrapers
slammed
slap
sledging
sleep
sleeveless
sleeves
slightest
slightly
slippers
slogans
sloshed
slur
smacked
smallest
smoothly
smriti
snatching
software
soldiers
someday
sometime
son's
sonam'
sons
sor's
sore
soup
source
sovereign
space
spanish
sparked
speak
specially
spectacular
speculating
speculation
speculations
speedy
spent
spices
spiked
spin
spinners
spoken
spokesman
sponsored
sport
sporting
sportsman
sportsmanship
sportspersons
spotted
sprayed
sree
srh
srh's
srikanth
srinath
staffers
stampede
stand
stands
stanford
stars
starts
startup
stated
statements
states
station
staudium
stayed
stays
steffen
stimac
stocks
stoinis
stokes
stooped
store
street
streets
strength
stress
strike
stunning
style
sub
submitted
subside
substances
substantial
successful
suddenly
sudharsan
suggest
suhana
suitable
sumit
summoned
superb
supergiant
superior
superstar
supported
supports
suppose
surge
surprise
surrogate
surrounded
suspend
suspicious
sustained
suvivor
sweep
swords
sylhet
symonds'
t-shirt
t0
t20is
tag
tags
takers
talents
tampering
tank
tape
targetted
tata
teacher
teaches
teammate
teammate'
teams-
tear
tech
technical
techniques
telecasting
telephonic
temple
temporarily
tension
tenure
terrible
testing
texas
thane
thankfully
thawb
theatres
thereafter
thereby
they've
thinking
thoguth
thoughts
threat
threatened
threatening
three-day
throat
thronged
throughout
ticket-collection
ticketing
tie-breaks
time-bound
tip
tire
tired
token
tolerate
tom
tomar
top-scorer
topped
torrent
tose
totalling
touched
touches
toward
town
traced
traces
track
trafficker
traitor
trans
transportation
travellin
travels
treat
trials
tributes
trophies
truly-deserving
try
turned
tuxedo
twice
twins-
twist
two-match
u-turn
uae'
ukraine
ukraine-russia
umpiring
unacceptable
unanimously
unclear
unconscious
undergo
understand
understood
undone
undue
unexpectedly
unhappy
unintentionally
unique
university
unlikely
unlimited
unsold
until
upper
ups
urged
urging
urvashi
usd
useless
usha
usman
usually
uttar
uttarakhand'
v
vacate
vaccines
vaishnaw
vajpayee
valentines
vandana's
vault
veena
vegetarian
vehemently
veil
venkatesh
venomous
venue
verdict
version
via
viacom18's
vice
vicious
viewed
viewership
vijayakumar
villa
vimal
vinod
violate
vip
virendra
viruskha
visuals
volleyball
vow
wada
wade
wagon
walkover
walks
warmup
warne'
warned
warner
warning
warrant
warriors
waste
watched
waved
waving
wayne
ways
we're
wears
weekend
welcomed
white
whole-heartedly
wicket-takers
wicketkeeper-batsman
wides
wife's
wikipedia
william
williamson
williamson'
windshield
wine
wiping
withdraw
withdrawal
witnesses
wnet
wonder
wooden
word
workload
works
worried
wpl
wrecking
written
yash
yellow
yesterday's
yo-yo
yograj
yoshihde
younger
youngest
youngsters
yuki
yuvraj's
yuzvendra's
zadran
zealand'
zlotys
