<unk>
<pad>
<s>
</s>
the
and
to
in
a
of
was
is
for
he
on
that
were
with
his
match
this
india
as
it
are
has
they
not
will
by
have
at
had
you
be
team
world
from
their
indian
people
won
after
i
said
however
but
also
now
an
matches
when
about
her
there
all
cup
she
cricket
ipl
played
very
him
then
players
who
well
first
we
which
over
kohli
out
runs
would
been
against
time
rs
pakistan
bcci
dhoni
did
held
lost
one
teams
captain
if
many
england
2022
between
went
scored
win
being
play
because
media
2023
everyone
what
other
2
me
while
both
during
fans
games
medal
even
final
know
medals
olympics
see
stadium
tournament
3
two
years
crore
singh
viral
finals
like
police
so
t20
test
these
why
am
social
sri
started
video
deaf
let
only
took
5
new
australia
csk
etc
football
india's
more
mumbai
no
october
or
since
up
victory
virat
2021
6
announced
can
4
huge
pm
same
sports
tell
wickets
day
gold
international
may
odi
player
them
back
cricketer
delhi
lanka
such
support
want
due
each
go
just
news
overs
series
sharma
amazing
group
july
made
1
any
bat
before
do
going
my
playing
some
women
8
cricketers
indians
lakh
proud
year
2020
family
into
south
super
take
watch
afghanistan
africa
around
asked
championship
could
couple
decided
down
earlier
game
how
its
kings
last
next
old
saying
-
another
athletes
called
decision
instagram
minutes
must
part
posted
tokyo
total
wanted
women's
yuvraj
10
50
august
bowler
came
chennai
currently
get
goals
happy
here
hotel
left
love
never
place
score
staff
taken
times
winning
along
away
comments
countries
days
gambhir
government
known
lot
men
messi
modi
most
raina
recently
rohit
second
shocking
trophy
wonderful
wrestlers
zealand
9
always
amrapali
ball
batting
bowl
excited
icc
kumar
loss
paid
rahul
rights
silver
start
taylor
tickets
too
various
wait
where
4th
april
argentina
auction
company
covid-19
does
got
led
long
number
olympic
participated
person
shah
tested
than
wicket
wow
yesterday
15th
23rd
across
argument
asia
balls
batsman
become
bowled
championships
coach
court
different
every
fan
following
gujarat
hardik
home
june
kept
married
met
million
named
our
per
ronaldo
seen
sent
shocked
star
sushil
till
toss
1st
20
2019
age
allowed
badminton
batsmen
became
covid
don't
end
extremely
face
field
finally
followers
former
found
girl
given
hope
incident
jadeja
javelin
keep
later
men's
november
pay
picture
pictures
positive
reason
run
sad
scoring
season
september
similarly
strong
told
12
15
association
athletics
best
catch
come
dubai
euro
famous
happened
hard
help
immediately
league
lose
lucknow
minister
months
ms
name
neeraj
off
pandemic
pandya
parents
performance
poland
post
punjab
qatar
qualified
rajasthan
rcb
reached
really
sapna
secured
set
should
son
soon
spectators
tennis
third
three
training
used
wife
your
14th
30
7
ahmedabad
ban
bowling
british
broke
bronze
call
cases
centuries
chahar
challengers
congratulations
country
father
february
few
fine
image
innings
instead
isn't
jay
jersey
khan
kl
members
pant
penalty
put
remaining
report
royal
sameeha
saw
shared
sure
team's
through
throw
tv
twitter
us
walked
way
wedding
wfi
wrestler
14
18
2012
able
according
again
amount
australian
believe
board
brand
break
broadcasting
brought
bumrah
c
carlsen
chopra
close
committee
compete
complaint
danushka
daughter
death
done
encourage
fast
find
followed
food
four
friends
gave
gift
good
groups
half
handed
high
hit
hyderabad
including
lankan
life
lionel
marriage
messages
others
participating
points
pune
response
right
room
rooney
royals
several
shaw
show
sold
special
spinner
still
taking
talking
thanked
those
tweeted
uae
vs
watching
wear
whoa
wrestling
yadav
yet
young
'i
'‚¹
10th
11th
13th
16
16th
2000
2016
2nd
3rd
5th
actually
anushka
asian
baby
bad
bangalore
beliefs
book
camera
capitals
car
case
chief
chose
commonwealth
congratulated
crazy
cummins
cwg
dating
december
defeat
disappointed
empire
ended
entire
flight
focus
footballer
full
god
hearing
helped
hospital
hours
includes
interesting
involved
italy
japan
kkr
losing
luck
man
manchester
march
matter
means
meanwhile
mohammed
moment
names
national
negative
official
online
outside
overjoyed
package
pakistan's
pakistani
photo
position
present
president
rain
received
removed
reports
rest
retirement
rule
rules
screens
seven
shobit
similar
sindhu
situation
skipper
state
stop
stopped
strange
table
tendulkar
thought
threats
top
towards
umpire
under-19
united
waiting
weeks
whenever
work
12th
1992
2011
2017
23
27
achievement
afghan
already
ambassador
announcement
anything
arrested
arshdeep
athlete
azam
bag
bangladesh
based
beat
bid
bidding
biles
bottle
brilliant
broken
captaincy
career
cash
category
ceremony
champions
changed
charge
child
children
community
complete
completed
continues
controversy
coronavirus
cristiano
dahiya
dhoni's
didn't
disgusting
district
doctors
elated
eriksen
excitedly
faced
failed
fifa
filed
fined
finger
five
flag
form
girls
glued
goal
goes
hands
haryana
having
head
heart
hence
highest
history
hotels
infected
infection
injury
issued
jaiswal
january
kaur
knight
krunal
lead
make
making
medical
mi
mirabai
money
morning
mother
move
mp
narendra
need
needed
once
participate
personal
postponed
presented
prime
prior
probe
qualify
rana
remember
respect
retire
riders
rumours
sachin
sadly
say
secretary
security
selected
semi-finals
shami
six
skills
statement
stay
stood
story
stressed
strict
stumps
superstitions
supposed
suresh
surgery
symonds
takes
taliban
though
today
train
trolled
updates
upto
usually
viewers
weightlifter
welcomed
within
without
women'
11
17
1983
2018
26
28
28th
29
60000
61
6th
7th
8th
9th
agreed
ahead
amazed
andrew
anyone
argentina's
asking
attack
azam's
b
babar
bcci's
beer
behaviour
ben
better
birth
booked
brawl
buy
can't
canada
cancelled
care
caught
celebrating
celebrities
century
chahal
chanu
chartered
clash
club
comes
comfortable
companies
competing
congratulatory
continue
covered
created
crores
current
decide
deepak
defeated
despite
devastated
dhanashree
digital
disappointing
dravid
drink
dropped
early
easy
english
equal
event
events
everyday
everything
example
false
federation
feel
felt
finished
fir
formats
further
gesture
gloves
handle
harbhajan
hardwork
harmanpreet
health
heavy
hockey
hoping
hungary
important
included
india'
india-pakistan
it's
jokingly
jump
kartikeya
kolkata
kumble
legendary
let's
lgbtqia
lifted
list
live
london
look
looked
looking
loved
lucky
mandhana
meet
member
mental
message
messi's
milkha
mind
mirza
mlc
month
much
multiple
natasa
netizens
night
noticed
numbers
opening
own
owns
pad
panel
passport
patel
pathirana
performed
period
polish
practice
practise
praggnanandhaa
praised
press
price
privacy
private
public
quarantined
railways
raining
rains
rape
ravi
ravindra
recieved
record
region
remove
respective
retired
rhiti
rising
ross
runner
rushed
sagar
sai
sanayev
seconds
semi
sex
shootout
shot
showed
side
siraj
site
sky
sourav
sponsors
stadiums
stage
staying
stepping
stunned
supporting
t20i
talks
target
teammates
tests
thank
thing
tie
titans
tough
tournaments
travel
tried
trouble
turn
umpires
unable
under
understand
unfortunately
using
verma
village
vinesh
violent
water
wearing
whether
wicketkeeper
winners
wish
woman
1-1
120
19
1998
2-3
2008
2010
22nd
24
25
250
25th
29th
31
35
49
700
935
absolutely
accompanied
account
accounts
adani
added
admitted
advertisements
air
ajay
albanese
ali
allegations
alleged
although
america
amidst
angry
anil
appeared
ashes
asif
ask
attacks
attended
available
award
aware
batter
beaten
began
behind
beijing
belgium
believed
bengaluru
big
booking
born
bottom
bought
bowlers
builder
calm
capital
captainship
caption
carry
casteist
celebrate
celebrated
celebratory
ceo
challenges
chandigarh
change
chase
china
christian
cities
claimed
clear
clothes
coca-cola
collection
colombo
commentator
commented
complained
condom
condoms
conference
congress
consisted
contain
contingent
continued
controversies
copa
costs
council
count
crowd
crowds
culprits
cups
daily
daley
de
deaflympics
debut
dedicated
deducted
deepika
delay
delayed
demanding
demise
denmark
died
difficult
dinner
discipline
dismissed
domestic
draw
drinks
duck
easily
ecstatic
ensure
escorted
expensive
experience
expressed
facebook
fake
families
far
favourite
fines
forward
fox
france
free
french
friend
ganguly
gathered
getting
giants
gill
give
giving
goalkeeper
golden
great
ground
guests
halted
hand
hansi
hate
haven't
heated
heineken
hong
hoped
host
hurt
hush
hyderabad's
images
inappropriate
incidents
incorrect
information
injured
intense
internationals
introduced
ish
ishan
issue
issues
janeiro
jasprit
jaya
joined
jubiliant
kalsan
keech
killed
kishan
kong
kuwait
landed
large
leading
leaked
legends
less
living
lockdown
logos
loves
major
managed
maria
massive
maå‚ysa
meeting
might
miny
missed
mobile
movement
muslim
nine
nothing
oath
oc
odis
oh
one-day
opted
ordered
organised
owned
owners
passed
paying
phogat
pick
pitch
places
platforms
plays
please
pogba
pooran
posting
posts
pradesh
premier
prevent
prize
problem
problems
professional
protest
protesting
quick
quickly
quiet
racial
ramnagesh
ranji
rate
rates
reach
recent
refused
regular
released
reliance
religion
religious
reply
reported
request
rescheduled
reshared
responsible
resume
return
returning
revealed
reward
rio
round
rubbish
safe
safety
sakshi
sat
save
scheduled
screen
secure
seeing
selfies
share
sharing
shooting
sides
sixes
slapped
slow
smith
smriti
something
sor
sorry
spin
spoke
sponsor
spreading
squad
srh
starts
step
stepped
stump
succession
sudden
sunrisers
superstition
supporters
supreme
surprising
surprisingly
sydney
talented
talk
thakur
think
ticket
tie-breaker
tied
title
touch
turned
tweet
uk
umpire's
undergo
upset
usa
usman
uttar
vamika
vandana
vehicles
venues
videos
virus
vows
wac
warne
wasn't
weightlifting
welcome
whopping
whose
wishes
wondering
words
wore
worked
working
world's
worried
wrong
wrote
yashpal
yes
youth
'‚¹2
100
108
1206
126
128
13
13000
142
150
18th
1930
195
1965
1976
1979
19th
2013
211
21st
22
240
249
24th
3-match
30th
32
3562
36
39
448
46
48
48390
50000
51
52
54
55
56
630
65
73000
75
90
91
abuses
accepting
accident
achieved
achievements
act
actor
actress
adamant
agency
ago
aim
airport
akos
alcohol
alive
all-rounder
ambulance
amid
among
analyst
anand
app
applied
approached
area
arm
armbands
arrangements
arrest
arrival
ashish
ashwin
assault
attempt
auctioner
audit
australia'
avoid
badly
bagged
balwani
banglore
banned
bare
base
baseless
batters
becuase
belongs
below
bhushan
biggest
bike
black
bottles
bounces
boy
boys
brij
brother
building
business
butter
bwf
calling
camel
cameras
cancellation
candy
cap
capacity
captains
captured
careful
celebration
chair
chaos
chat
chatted
check
chess
chest
chhetri
chocolates
choice
citizens
city
civilian
claim
clarity
closed
collect
collected
comment
commercial
common
communicate
company's
completely
condition
conduct
consoled
cops
couldn't
county
couples
cover
cpr
crease
credit
crime
crush
cure
cvc
d
dalit
date
dated
daughter's
deeply
defended
demanded
depending
details
detained
developers
development
dhanush
director
disparity
diving
doesn't
doing
donated
double
doubles
dreams
drinking
duo
duped
e-tickets
earn
efforts
eighth
elected
else
emergency
emotions
encouraging
ends
england's
enraged
euros
eventually
exact
excellent
expected
expenses
extra
fantastic
fareed
fastest
fee
feelings
fees
fell
fierce
fight
figures
file
filled
financial
fired
fit
fitness
five-match
flooded
flu
footage
forget
fourth
franchises
fun
future
gaikwad
gap
garnered
gautam
gay
generally
german
germany
gets
girlfriend
glass
gone
grabbed
grade
grandfather
grateful
grew
group's
guwahati
gymnast
hasn't
hazel
healthy
heartbroken
himself
historic
hitting
hold
holding
holds
holiday
honour
hou
house
housing
human
idca
ideas
idesign
immunity
imposed
improper
include
income
increase
increased
indies
indigo
indiscipline
individual
infant
info
inform
informed
innocent
inquired
insisted
inspector
insta
instance
interacting
interaction
interested
invested
investigation
ioc
ipad
ireland
jail
james
jantar
japanese
jealous
jerseys
jets
join
joins
kanyakumari
key
knee
knitting
knows
kohli's
korea
krishnan
kuala
kylian
lack
lakhs
largest
late
launch
leaders
leadership
learn
learnt
leaves
leg
leg-spin
level
liked
limit
lips
little
lives
logo
loud
lsg
lucknow's
lumpur
magnus
mahindra
maiden
maintain
majorly
malayasia
malik
mammoth
manager
manipur
mantar
marcus
margin
marketing
marry
marsh
mean
measures
medalist
men'
mers
merseyside
middle
middle-class
ministers
ministry
miss
missing
mistake
mocked
model
models
mohammad
moroccan
moroccans
mouths
moved
moves
mr
mural
murdered
nabi
nadeem
nadu
nations
near
needs
neeraj's
neither
nicholas
nirmal
nitika
note
office
officer
often
omicron
ongoing
onto
open
openly
opponents
option
order
organisers
original
outstanding
over-rate
oversight
owner
pads
padukone
pakistan'
par
particular
parties
partners
partnership
passports
pat
perform
performing
permitted
personalities
personnel
persons
phone
phones
picked
pizza
placed
planned
plans
platform
playoffs
politely
politicians
popular
posed
possible
practises
preparing
preponed
previously
pride
proceeded
process
projects
prominent
proof
propose
proposed
protective
provide
purchase
pv
questioned
quit
quite
r
rabada
race
rainbow
raise
rana'
rank
ranked
rankings
ranveer
rashid
rather
realised
reasons
receiving
refunded
related
relief
relocated
remain
remained
renew
renowned
replaced
represented
representing
residence
resignation
respected
respond
restaurant
result
returned
revealing
rich
richest
ring
rise
rishab
risk
road
rockets
ronaldo's
rooms
rosario
rpsg
rsws
rukh
running
russia
saddened
saff
salaries
sandwich
sandwiches
sania
sapphire
scam
schedule
scoreboard
seeking
semi-final
separate
serious
shameful
shane
shares
sharma's
shaw's
sheuli
shock
shoes
short
shortlisted
shots
similarities
single
skeptical
skin
sleep
slurs
small
smashed
someone's
sonam
sources
spending
sporting
spraying
spread
sprinter
stadium's
standing
stands
stankovic
starting
stayed
stokes
stories
streets
stunning
submit
subsidiary
succeed
suffered
summoned
sun
supermarket
surprise
surprised
survived
suspended
symonds'
symptoms
t-shirts
t20is
talked
tally
tamil
tax
teammate'
tenders
texas
that's
thereafter
thousands
threatened
thrilling
throughout
thrower
today's
together
tops
towel
town
trained
traveled
travelled
tray
treatment
trent
troll
trolling
trolls
true
truly
types
u-19
ukraine
unbeaten
uncle
unhappy
unique
until
unvieled
upcoming
update
upon
urvashi
use
user
users
usha
vaishnaw
vamika'
variant
vengsarkar
version
viacom18
viacom18's
victories
violence
virendra
visit
visuals
walking
wankhede
warne'
waste
wealth
website
west
whereas
whole
withdrawal
wives
woller
works
wpl
x
yoga
york
yuzvendra
zaheer
'eriksen
'madewithlovebytomdaley'
'people
'the
'why
'œ
'œpeople
'œthe
'œusman
'œvirat
'˜
'˜7'
'˜finally
'‚¹35
'“
--
0
0-100
01
1-0
1-2
10-15
100-metre
1000
10000
103
10m
111
112-run
114
121
122
123
132
133
1355
137
147
1472
149
14th-15th
1520
1525
159
1659
170
171
172
1724
173
175
175000
176
179
183
184
1882
189
1923
1930s
194
1951
1959
1960
1966
1968
1978
198
1986
1988
1999
2-0
2-1
2-2
2-4
200
20000
2003
2005
2006
2007
2009
2015
2021'“22
2024
2027
2055
20th
21
2144
215
217
2183
219000
221
226
228-runs
23-year-old
230
23575
237
241
245
251
260
263
267
269
27000
2759
2777
27th
293
3-2
300
300kg
310
313kg
3175
31st
32-run
321
3258
337
34th
356
3570
37-year-old
38
4's
4-3
40
400
400m
42
4222
45
450
4573
464
4x400m
5-match
5166
525
5522
56-member
5610
58
594
5950
6's
6-3
62
63
652
655-member
65kg
66
67
69
6am
7-5
70
708
71
72
73
730
73kg
78
80
8000
81
83
87
8703m
883
90-minute
91000
911
915
92
95
96
97
98
99
aaron
abhijeet
abhinav
above
abruptly
absentminded
absolute
abu
abused
abuzz
academy
acc
accepts
accomadation
accomplisments
accordingly
accountant
accpet
accused
ace
achieving
achinta
acted
action
active
activist
adminstration
admires
ads
advanced
advancement
advert
advertisement
advertisers
advised
advocating
aerated
afc
affair
affairs
affection
african
againt
agastya
aged
agencies
aggressive
agitated
agree
agreements
agrees
agua
ahmed
ahmedabad-based
ailing
aiming
aires
airfare
airline
aiscd
aita
ajaz
akshay
aliana
alibathini
alike
allah
allow
almost
amounts
anees
angel
angeles
anger
angom
anita
anju
announce
annual
anonymous
ans
answers
anthony
antwerp
anurag
anybody's
anymore
anytime
apart
apex
appear
appearances
applauded
applause
apple
applicable
applies
apply
applying
appointed
appointing
appreciation
approved
arabia
arbitration
arbitrator
arch
arch-rivals
archer
archery
ardent
arena
argentine
argue
arguing
arguments
aromatic
arshad
arshdeep's
arsheep
arson
arun
arvind
ashwini
aside
assists
assume
assurance
asthma
asymptomatic
atal
athapaththu
athiya
atkinson
atleast
attacked
attain
attend
attention
attitude
attract
auctioned
aurobindo
aussies
australia's
authorities
authority
autobiography
autographs
availability
avesh
awaited
awake
awarded
awards
awared
awareness
awful
axar
ayurvedic
azharuddin
babies
babycare
backdrop
backfired
background
backside
bags
bail
balaji
bang
bangalesh'
bangalore'
bars
barwin
barwin'
baseball
basis
bathroom
batra
bats
batsman-wicket
batsmen's
bawa's
bay
beating
becoming
bed
beds
begin
beleive
belgian
belief
believes
belligerant
belongings
bemused
beneficial
bengal
berlin
besides
bestowed
betweeen
betweem
beunos
bhaichung
bhambri
bharadwaj
bhardwaj
bhojpuri
bhutia
bidder
bids
bigg
bihari
bike-lover
bikes
bilateral
billions
bindra
bingjiao
biren
birmingham
birthdate
birthday
bite
bjp
blamed
blast
bleary-eyed
blessing
blessings
blushing
boards
bobby
bold
bollywood
bond
bookingcom
boost
boot
booth
border
boris
boss
bout
bowler's
box
boxer
boys'
brazil
breaking
breathed
bring
bringing
broad
broadcast
broadcaster
brooke
brotherhood
brussels
bta
budapest
bullet
bursted
bursting
businessman
businessmen
buyers
buying
buzzing
byjus
cafes
calculated
calculation
california
calls
calmed
cancel
cancer
cannot
canoe
cape
caps
captained
capturing
cares
caribbean
carried
cars
casillas
caterers
cautious
cbd
celeb
celebs
cell
cements
cent
central
centre
centruries
certain
chahal's
chain
chains
chairperson
chakravarthy
challenge
chamari
champagne
champion
chance
changes
changing
channels
channu
chanting
chants
chanu'
charged
chargers
charges
charging
charu
chased
chasing
chats
chawla
cheap
cheaper
cheapest
cheated
cheer
cheered
cheering
cheers
chefs
chemical-free
cherish
chhatrasal
chhattisgarh
chidambaram
childcare
chills
chinawhite
choose
circled
cited
civilians
clarification
clashed
class
cleaning
cleared
clicked
clicking
cloak
closer
clothing
cm
co-founded
coaches
coaching
coca-cola's
cochlear
coincidence
collapsed
colour
combined
combining
comfortably
commence
commenced
commendable
commended
commentary
commission
commitment
communicating
communication
community'
competed
competition
competitions
competitive
complain
completly
compressions
compromise
conceded
concern
concerned
concerns
condemned
condolence
confederate
conferred
confident
confirmation
confirmed
confrontation
confronted
confused
congratualtory
congratulate
congratulating
consecutive
considered
considering
constantly
constellation
constituted
consulted
contact
contacted
contacts
contents
contested
continental
contributed
contributions
control
convenience
conversation
convey
cook
cooking
coooking
cooperative
copenhagen
corporate
cost
costed
coughing
council's
counted
couple's
crackers
crashed
crashing
craze
crazily
create
creating
cricker
cricket'
cricketer's
cricketers'
cricketing
criminally
cristano
critical
criticism
crown
cryptic
crypto
cryptocurrency
csk's
cultural
culture
curries
cut
cute
cuttack
damaged
damaging
dance
danced
dancing
danger
danish
dates
daughters
dead
dead-rubber
deadline
deadly
deaf'
deal
debuted
deccan
decimating
decisions
declared
declines
decorated
dedication
deducting
defence
definitely
deleted
delhi'
delhi's
delighted
deliveries
delivery
delta
deluxe
demand
democracy
denmark'
departure
deployed
derby
deshmukh
designed
desparate
destiny
destroying
detail
determination
determine
dev
devdutt
devices
dhabi
dharamshala
dhawan
dhumal
diamond
diana
diarrhea
dias
dicc
diego
diet
difficlut
dignitaries
diligently
dilip
dinesh
direction
directly
disapproval
disclosed
discrimination
disgusted
dish
dismissing
displaced
display
displayed
disrespecting
disrupt
dissappointed
dissolution
distance
diver
divert
diverted
divide
divided
document
documents
doherty
dollar
dollars
dominos
donate
donation
door
doors
doping
doubt
downloaded
downloading
dozen
dream
dressing-room
driving
drowned
drs
drugs
drunk
du
dues
durham
dushyant
dutt
duty
eager
earned
earns
earth
east
eat
eaten
edge
edited
edition
editions
edmeades
education
edulji
eight
eishrajpoot1
either
electronics
elise
elizabeth'
eloped
embarassing
embarrassing
embroiled
emerged
emi
emirates
emmanuel
emmerged
emoji
emotion
emotional
employee
empty
encounter
encouraged
end-of-series
ending
endorsing
enemies
engaged
engineer
engraved
enjoying
enough
enter
entered
enthusiasm
entities
entrance
entrusted
enzo
equally
equestrian
equity
erskine
especially
eunuch
eur
europe
european
eva
evaded
evening
ever
everton
exacting
exactly
exam
excelled
excellence
except
exceptional
exceptionally
excessive
exchange
exciting
excuses
executives
exhausted
exit
exoected
exorbitantly
expectation
expelled
experienced
experiences
expert
explain
explained
explanation
exposure
expression
extended
extraordinary
fa
facts
faf
faith
fall
fallen
falling
falls
faltered
fame
family's
fanatic
fans'
farewell
fault
favorite
fears
feat
featuring
fedup
feeling
felicitated
fellow
female
fencing
fernandez
festival
fever
fielders
fielding
fifa's
fifties
fighter
fighting
files
fill
films
filmstars
finances
finch
finest
fingers
finishing
finland
firecrackers
fireworks
firm
fish
five-over-per-side
fix
flags
flashed
flats
flew
flighter
flights
flow
fly
focused
focussed
folding
follow
follows
follwed
folowers
force
forced
forgo
fortis
fortunate
fouaad
founder
four's
fours
fourth-highest
frame
france's
franchise
freedom
freehit
freestyle
frequent
front
frustrated
fund
funds
funny
furious
fury
gained
gaming
gandhi
gang
ganguly's
gary
gavaskar
gemma
gender
george
georgina
gestures
giant
gifted
gives
glad
globe
glove
gmr
goa
goenka
gold'
gotten
governing
graciously
graded
gradually
grandmaster
grandson
granted
grate
greeted
ground-staff
grounds
grow
growing
grown
gt
guilty
gujarat's
gunathilaka
gunathilaka's
gurudwara
guts
gymnastic
gymnastics
habit
habits
hadn't
half-centuries
half-century
halfway
halves
handkerchief
handles
handsome
hanged
hanging
happens
happiness
harass
harbhajan'
hard'
haridwar
haris
harmony
harrassment
harsh
hassles
hasty
hatrick
hats
hattrick
havoc
hawker
headache
headers
heartbeats
heartbreaking
hearted
heartfelt
hearts
heartwarming
hearty
hebestreit
heckle
height
heights'
hellcat
helmet
helpless
henious
heroes
hiked
hiv
homebuyers
homeland
hometown
homosexuality
honest
honoured
hooked
hooligans
hopes
horns
hospitals
hosted
hostess
hosting
hosts
hour
houses
hra
hugged
hugging
hugh
humble
hundred'
hundreds
hungary's
hunter
hurled
husband
hygienic
hypocrite
i'll
i'm
iaaf
icc'
icc's
iconic
icu
idcc
idea
ideally
idols
ie
ignorance
ignore
ignored
iker
illegal
imagine
imjadeja
immense
impact
impartial
imphal
implants
impose
impossible
impressive
impulsive
imran
imtiaz
inaccurate
inapt
inclined
increasing
incredible
incubation
indefinitely
independence
india-
india-new
india-pak
indian's
individuals
industries
infact
infections
infidelity
influencer
infuriatred
initial
initially
injuries
inning
inputs
inquire
insane
inscribed
inside
inspired
inspiring
instaram
instructions
insult
insulted
integral
intended
intensely
intensity
intensive
intention
interacted
interest
interference
internet
interogate
interogated
interrogation
intervals
intervened
interviewed
interviews
invaded
investigate
invited
involvement
invovlement
ioa
iphone
iphones
iphones'
ipls'
isl
isolation
ist
italy's
itc
items
itself
izhaan
jailed
jammu
jan
javelineer
javelins
jayne
jeremy
jharkhand
job
jogeshwari
johnson
joints
joke
joked
joking
journalist
jr
jubilant
jubliant
judge
judiciary
judo
juhi
junior
kagiso
kaif
kakching
kane
kanteerava
kardashian
karnam
karthik
kashmir
kasi
katariya
kazakhstan's
keen
keeper
keeping
keeps
keg
kejriwal
kg
khalistan
khan's
khan-led
khawaja
khwaja
kids'
kieron
kill
killing
kim
kind
kingdom
kings'
kissing
kit
kiwi
kiwis
kmhour
knees
knew
knife
knit
knock
knocked
knocking
knockout
knot
knowledge
kochi
kohli'
kom
konkan
kozhikode
kuldeep
l
la
laced
lalrinnunga
language
lap
lashed
lasted
lastest
lasting
lasts
laugh
lavish
law
lawn
laws
lawyer
layers
laying
leader
leagues
leander
learned
learning
least
leave
leaving
lee
leicester
lend
lesbian
lesser
lessons
letter
levied
liberty
life'
life-saving
lifelong
lifting
light
lights
likely
likes
likewise
limited
lingerie
link
listen
littered
lived
loads
lobster
local
locked
lodge
lok
london'
lonely
long-handle
longer
looks
los
loses
lots
louis
low
lower
ltd
lunch
luxurious
luxury
lyons
ma
maate
machester
macron
madhya
magical
maharashtra
mahavir
mahendra
mahi
majority
maker
malaysia
male
malleswari
manage
management
manages
manika
manipur'
manyt
maradona
mark
marks
martinez
martyred
maruti
mary
masked
mateo
matthew
maximum
maybe
mayor
mbappe
mbappã
mca
me'
medications
medicine
mega
mehta
melbourne
melvin
meme
memes
mentally
mentioned
mentor
menu
mere
messaged
messi'
mic
microphone
midway
mine
minor
minute
miny'
mirza-malik
misbehaving
miscreants
mismanagement
missile
misunderstand
mixed
miå‚oszek
mocking
mockingly
mode
mohali's
moments
monsoon
moreover
morgan
morocco
morocco's
mostly
motion
motivated
motive
mouth
movie
moving
mrf
mumal
mumal's
mundka
murder
murders
muscle
muster
n
nails
name'
namibia
naresh
narrowly
naseem
nasty
natalie
natasha
native
nature
navi
navjot
navratri
nearly
necessary
needto
neophitou
nepal
nervous
netherland
netherland's
netherlands
neutrality
newer
nice
nicest
nigeria
ninth
nishant
no-balls
nobody
noida
non-bailable
non-exclusive
non-payment
nonchalantly
nongpok
nor
normal
norms
north
notably
numerous
nurislam
nurses
o'brien
objecting
observations
off-spin
offence
offensive
offering
offers
officers
officials
offspring
okay
olympians
oman
once-in-a-generation
one-off
onus
opened
opportunities
opportunity
opposed
opposing
opposition
oppressed
oppressive
optimism
orcas
organisation
organising
origin
orion
otherwise
ott
outbreak
outfit
outfits
outing
outrage
over-rate'
overall
overcome
oversaw
overseas
overwhelmed
owning
oxygen
oylmpics
p
padikkal
padma
paes
pain
pair
palms
paltry
pandya's
pani
pans
paper
papparazi
participants
parts
passionate
past
paste
patiently
patted
paul
pavilion
paytm
pbk
penalised
percent
perfomance
performances
permission
permit
perserve
persue
perth
pgimer
pharma
pharmaceuticals
photograph
photographys
photos
physical
physios
picking
piece
pierced
pinned
pivotal
player'
player's
players'
playmaker
playoff
plea
pleas
plessis
plethora
plunged
pockets
point
pointing
pole
policywhich
political
politics
pollard
poor
poorly
pops
popularity
porche
portion
portugal
portugal's
portuguese
pose
positivity
post-match
postion
postpone
postponement
pouring
practices
practised
pradesh's
precautions
predicted
predictions
pregnant
preliminary
premadasa
premiere
premises
prepare
presentation
pretended
pretty
priety
prince
prison
prithvi
proceedings
proceeds
processing
produced
products
profitable
programmes
programs
project
promised
promote
promotion
properties
property
proposal
prosecuted
proselytizing
protein
prove
provides
provincial
pt
pti
pubg
publicly
published
publishes
punia
punished
purchased
puri
push
qualifed
qualifies
quarter
quarter-finals
quarters
queen
question
questioning
queues
quiter
quoted
rachin
racked
rage
rain-soaked
raipur
raised
raj
rajat
rajeev
ramanathan
ramesh
rameshbabu
ranchi
ranking
raped
rapid
rashford
rashford's
rauf
rautela
rautela's
ravichandran
reaching
read
reading
ready
reaffirm
reality
realizing
receive
recognise
recognised
recognition
recognized
recording
records
recovers
recovery
recreated
reduced
referee
refrain
refund
regained
regarding
registering
registration
regret
regularly
regulation
rejected
relationship
relative
relaxed
relay
release
religions
remark
removes
renamed
renewal
renewed
rent
rents
renuka
repeat
replace
replied
reporters
representative
republic
reputation
requested
required
reschedule
rescued
resorted
resorting
resorts
respecting
respectively
respects
respiratory
responded
restart
restarted
restaurants
restrictions
resturant
results
resumed
retain
retained
retainership
returns
reveal
revenge
reviewing
rew
rewards
richer
right-arm
rings
rioting
riots
risers
rishabh
risks
ritual
rival
rivalry
rizwan
rod
rode
rodrã­guez
role
roma
rome
ronald
ronalda
ronaldo'
rooney'
roped
rose
roshnabad
rotterdam
roughly
rounder
rounders
rounds
routes
routine
rpg
rto
rtpcr
ruining
ruled
rumors
rupees
rushes
russian
ryan
sabha
sacking
sacrifices
sadened
safeguarded
safely
saha
sahara
saharan
sahicoin
sailing
sale
salute
samir'
samosas
sample
sandeep
sanjana
saphire
sapna's
sarcastic
satisfactory
satisfied
satish
saturday
saudi
sc
scammed
scandals
sceond
school
schools
sciver-brunt
scorer
scores
screenings
scst
season'
seasons
seats
seattle
secondly
secret
section
sections
securing
seem
seemed
sehwag
select
selection
selectors
seller
selling
sells
semifinal
send
senior
sense
sensing
sensor
sentiments
separated
separatist
servants
served
services
session
settle
setup
seven-member
severely
sexual
sexually
shake
shakes
shaking
sham
shame
shamed
shamefully
shami's
sharan
shardul
shastri
shawl
sheets
shetty
shewag
shifted
shikhar
shirts
shiv
shoaib
shockingly
shoot
shoot-out
shoots
short-run
shortage
shorts
shoulder
shouts
shown
shri
shubman
shukla
shut
sick
sidharth
sidhu
sigh
sign
signalled
significant
sikh
silent
simone
simultaneously
sin
sincerity
sindhu's
singapore
singh'
singh's
singles
singlet
sister
sit
sixteen
sixth
skipped
skyrocketed
slammed
slap
sledging
sleeveless
sleeves
slightest
slippers
slogans
sloshed
slur
slurts
smacked
smallest
smashing
smoothly
snake
snapchat
snatching
software
solve
someday
someone
sometime
sometimes
son's
sonam's
sor's
sore
sought
soup
source
sovereign
spain
spanish
sparked
speaking
specified
spectacular
spectator
speedy
spent
spices
spike
spiked
spoilsport
spoken
spokesman
spokesperson
sponsored
sponsorships
sport
sportsman
sportsmanship
sportspersons
spotted
spouse
square
sree
srh's
staffers
staged
stall
stalled
stampede
stand
stand-in
stanford
startup
stated
statements
states
station
staudium
staycity
stays
steffen
stern
steve
sticky
stoinis
store
straight
strangely
strategic
street
streetside
strength
strike
stronger
strongest
stuart
style
sub
submitted
subside
substances
suburban
subway
successful
sudharsan
suggested
suhana
suit
sunday
sunil
sunlight
superb
supergiant
superintendent
superior
superstar
supplies
supports
surely
surname
surpassed
surrounded
survivor
surya
susceptible
suspicious
sustained
sweater
sweep
swiftly
swimwear
symbolises
synchronised
system
t
t0
tables
tackle
tag
tags
tai
taiwan's
takeover
takers
talent
tandoori
tank
targetted
tayler
teammate
teams-
tears
tech
techniques
technological
technology
telecasting
television
temple
temporarily
ten
tender
tendulkar'
tension
tenure
termed
territories
thailand
thane
thankfully
thanking
thanks
thats
thereby
things
thoguth
thong
thoroughly
thoughts
threat
threating
three-day
threw
thrilled
throat
throwing
throws
thus
ticket-collection
ticketing
tie-breaks
tiny
tip
tire
tired
toiled
tom
top-scorer
topped
torrent
totalling
totally
touched
touring
traced
track
traditional
traffic
tram
transactions
transgender
transportation
traveling
travellin
treasurer
treat
treatment'
trials
tributes
triggered
trip
triumph
troops
trophies
troubled
truncated
turns
tuskers
tweets
twenty-20
twice
twins-
twist
two-storey
twofold
tycoon
tyres
tzu
u-turn
uefa
uguev
ukraine-russia
unacceptable
unanimously
uncapped
unclear
undergoing
undergone
understood
unhygienic
unintentionally
university
unknown
unless
unlike
unlimited
unsatisfactory
unsold
up'
upper
ups
usa'
usd
username
utmost
uttarakhand's
v
vacate
vaccines
vaguely
vajpayee
valentines
valued
vamika's
vandalised
varun
vast
vault
vegetarian
vehemently
venomous
venture
venue
verdict
via
vice
vice-captain
view
viewed
viewership
vijayakumar
villa
vimal
vinesh'
violate
violation
vip
virender
visa
visible
viswanathan
voot
vow
vuitton
wade
wagon
walk
walk-out
walkover
walks
wanting
wants
war
warned
warning
warrant
warrier
warriors
warriorz
watched
waved
waving
wayne
ways
we're
weak
wears
weekend
weight
welcoming
wells
what's
white
wicket-takers
wicketkeeper-batsman
widely
wides
wikipedia
william
williamson'
wimbledon
windshield
wine
winner
wins
wiping
wished
withdraw
witnessed
witnessing
wnet
womens
won't
wonder
word
worn
worry
worsened
worth
wrapped
wrecking
wriddhiman
written
x132
xi
xuv
yellow
ying
yograj
younger
youngest
youngster
youngsters
yuki
yuzvendra's
zabka
zaur
zealand'
zealand's
zimbabwe
zinta
zlotys
